## Import Libraries and load Data

In [51]:
import pandas as pd
from sklearn import cluster

In [52]:
df = pd.read_csv("marketing_campaign.csv", sep = '\t')

## Data Cleaning

### drop missing values

In [53]:
df.dropna()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

### convert all columns to lowercase

In [54]:
df.columns= df.columns.str.lower()

### drop unnecessary columns

In [55]:
#drop "ID","Z_CostContact" and "Z_Revenue" column
df = df.drop(columns=["id", "z_costcontact","z_revenue" ])

### create new column "age"

In [56]:
df["age"] = 2022 - df["year_birth"]

In [57]:
df["age"]

0       65
1       68
2       57
3       38
4       41
        ..
2235    55
2236    76
2237    41
2238    66
2239    68
Name: age, Length: 2240, dtype: int64

In [61]:
#drop "year_birth"
df = df.drop(columns=["year_birth"])

### clean education column

In [58]:
df["education"].unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

In [59]:
def clean_edu(x):
    if x in ['Basic', '2n Cycle']:
        return ["Bachelor"]
    if x in ['Graduation']:
        return ["Graduate"]
    if x in ['Master', 'PhD']:
        return ["Postgraduate"]

In [69]:
list(map(lambda: clean_edu(for x in [df["education"]])))

SyntaxError: invalid syntax (3207419502.py, line 1)

### convert income to int

In [ ]:
df["income"] = df["income"].astype("Int64")

### clean "marital_status"

In [71]:
df["marital_status"].unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone',
       'Absurd', 'YOLO'], dtype=object)

In [72]:
df[df.values == 'Absurd']

,education,marital_status,income,kidhome,teenhome,dt_customer,recency,mntwines,mntfruits,mntmeatproducts,...,numstorepurchases,numwebvisitsmonth,acceptedcmp3,acceptedcmp4,acceptedcmp5,acceptedcmp1,acceptedcmp2,complain,response,age
2093,Graduation,Absurd,79244.0,0,0,19-12-2012,58,471,102,125,...,7,1,0,0,1,1,0,0,1,29
2134,Master,Absurd,65487.0,0,0,10-01-2014,48,240,67,500,...,6,2,0,0,0,0,0,0,0,65

In [73]:
df[df.values == 'YOLO']

,education,marital_status,income,kidhome,teenhome,dt_customer,recency,mntwines,mntfruits,mntmeatproducts,...,numstorepurchases,numwebvisitsmonth,acceptedcmp3,acceptedcmp4,acceptedcmp5,acceptedcmp1,acceptedcmp2,complain,response,age
2177,PhD,YOLO,48432.0,0,1,18-10-2012,3,322,3,50,...,6,8,0,0,0,0,0,0,0,49
2202,PhD,YOLO,48432.0,0,1,18-10-2012,3,322,3,50,...,6,8,0,0,0,0,0,0,1,49

In [76]:
#remove "absurd" and "YOLO" from "marital_status"
df = df.drop([2093, 2134, 2177, 2202])

In [78]:
df["marital_status"].unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone'],
      dtype=object)

In [79]:
def clean_marital(x):
    if x in ['Together', 'Married']:
        return ["married"]
    if x in ["Single", "Alone", "Widow", "Divorced"]:
        return ["single"]

In [80]:
list(map(lambda: clean_marital(for x in [df["marital_status"]])))

SyntaxError: invalid syntax (362172544.py, line 1)